tap "charmbracelet/tap"
tap "hungthai1401/tap"
tap "sorenisanerd/gotty"
tap "stakpak/stakpak"
tap "vinhnx/tap"
brew "asdf"
brew "autocode"
brew "cagent"
brew "cask"
brew "claude-code-router"
brew "claude-code-templates"
brew "code-cli"
brew "code-minimap"
brew "code-server", restart_service: :changed
brew "code2prompt"
brew "codeberg-cli"
brew "codebook-lsp"
brew "codec2"
brew "codecov-cli"
brew "codequery"
brew "coder"
brew "codesnap"
brew "codespell"
brew "codevis"
brew "color-code"
brew "cycode"
brew "docker-completion"
brew "gcc"
brew "eccodes"
brew "gecode"
brew "gemini-cli"
brew "geocode-glib"
brew "git-codereview"
brew "git-filter-repo"
brew "git-remote-codecommit"
brew "leetcode-cli"
brew "lolcode"
brew "ode"
brew "php-code-sniffer"
brew "pycodestyle"
brew "qrencode"
brew "qwen-code"
brew "recode"
brew "swagger-codegen"
brew "vtcode"
brew "wtfutil"
brew "x-cmd"
brew "yadm"
brew "yydecode"
brew "charmbracelet/tap/charm"
brew "charmbracelet/tap/soft-serve"
brew "hungthai1401/tap/occtx"
brew "sorenisanerd/gotty/gotty"
brew "stakpak/stakpak/stakpak"
cask "codex"
vscode "no installation of code oss was found."
vscode "if you already installed code and we didn't detect it, run `code version use oss --install-dir /path/to/installation`"
vscode ""